In [1]:
import numpy as np
import pandas as pd

In [2]:
df= pd.read_csv('zomato.csv')

# Asking Question which columns is not usable

In [3]:
df.drop(columns=['Restaurant ID'],inplace=True)

In [4]:
df.columns

Index(['Restaurant Name', 'Country Code', 'City', 'Address', 'Locality',
       'Locality Verbose', 'Longitude', 'Latitude', 'Cuisines',
       'Average Cost for two', 'Currency', 'Has Table booking',
       'Has Online delivery', 'Is delivering now', 'Switch to order menu',
       'Price range', 'Aggregate rating', 'Rating color', 'Rating text',
       'Votes'],
      dtype='object')

In [5]:
df.shape

(9551, 20)

In [6]:
df['Country Code'].nunique()

15

In [7]:
##tital countries are 15

In [8]:
df['Country Code'].value_counts()

1      8652
216     434
215      80
189      60
30       60
214      60
148      40
208      34
14       24
162      22
94       21
184      20
166      20
191      20
37        4
Name: Country Code, dtype: int64

In [9]:
mask=df['Country Code']==1

In [10]:
df=df[mask]

In [11]:
df.shape

(8652, 20)

In [12]:
## now we we can remove country code and currency because we have only one country in data set

In [13]:
df.drop(columns=['Country Code','Currency'],inplace=True)

In [14]:
df.shape

(8652, 18)

In [15]:
df['City'].nunique()

43

In [16]:
df['City'].value_counts()

New Delhi       5473
Gurgaon         1118
Noida           1080
Faridabad        251
Ghaziabad         25
Ahmedabad         21
Bhubaneshwar      21
Amritsar          21
Guwahati          21
Lucknow           21
Varanasi          20
Pune              20
Chennai           20
Agra              20
Allahabad         20
Bangalore         20
Mangalore         20
Nashik            20
Indore            20
Puducherry        20
Coimbatore        20
Goa               20
Surat             20
Kolkata           20
Kochi             20
Ranchi            20
Kanpur            20
Mumbai            20
Aurangabad        20
Bhopal            20
Mysore            20
Dehradun          20
Vizag             20
Patna             20
Vadodara          20
Nagpur            20
Jaipur            20
Ludhiana          20
Hyderabad         18
Chandigarh        18
Secunderabad       2
Panchkula          1
Mohali             1
Name: City, dtype: int64

In [17]:
mask=df['City'].isin(['New Delhi','Gurgaon','Noida'])

In [18]:
df=df[mask]

In [19]:
df.shape

(7671, 18)

In [20]:
df.drop(columns=['Is delivering now'],inplace=True)

In [21]:
df.shape

(7671, 17)

In [22]:
df.drop(columns=['Restaurant Name','Address','Locality','Locality Verbose','Rating color','Rating text'],inplace=True)

In [23]:
df.columns

Index(['City', 'Longitude', 'Latitude', 'Cuisines', 'Average Cost for two',
       'Has Table booking', 'Has Online delivery', 'Switch to order menu',
       'Price range', 'Aggregate rating', 'Votes'],
      dtype='object')

In [24]:
df['Has Table booking'].value_counts()

No     6640
Yes    1031
Name: Has Table booking, dtype: int64

In [25]:
df['Has Table booking'].replace('Yes',1,inplace=True)

In [26]:
df['Has Table booking'].replace('No',0,inplace=True)

In [27]:
df['Has Table booking'].value_counts()

0    6640
1    1031
Name: Has Table booking, dtype: int64

In [28]:
df['Has Online delivery'].value_counts()

No     5393
Yes    2278
Name: Has Online delivery, dtype: int64

In [29]:
df['Has Online delivery'].replace('Yes',1,inplace=True)
df['Has Online delivery'].replace('No',0,inplace=True)

In [30]:
df['Has Online delivery'].value_counts()

0    5393
1    2278
Name: Has Online delivery, dtype: int64

In [31]:
df.corr()

,Longitude,Latitude,Average Cost for two,Has Table booking,Has Online delivery,Price range,Aggregate rating,Votes
Longitude,1.000000,0.997721,0.071854,0.059863,0.138230,0.082031,0.221801,0.071482
Latitude,0.997721,1.000000,0.070816,0.060228,0.137746,0.081059,0.221399,0.071196
Average Cost for two,0.071854,0.070816,1.000000,0.643845,0.072198,0.848425,0.329785,0.297741
Has Table booking,0.059863,0.060228,0.643845,1.000000,0.072631,0.661477,0.251972,0.224377
Has Online delivery,0.138230,0.137746,0.072198,0.072631,1.000000,0.184855,0.339658,0.121491
Price range,0.082031,0.081059,0.848425,0.661477,0.184855,1.000000,0.372624,0.325489
Aggregate rating,0.221801,0.221399,0.329785,0.251972,0.339658,0.372624,1.000000,0.291500
Votes,0.071482,0.071196,0.297741,0.224377,0.121491,0.325489,0.291500,1.000000

In [32]:
df.columns

Index(['City', 'Longitude', 'Latitude', 'Cuisines', 'Average Cost for two',
       'Has Table booking', 'Has Online delivery', 'Switch to order menu',
       'Price range', 'Aggregate rating', 'Votes'],
      dtype='object')

In [33]:
df.drop(columns=['Longitude','Latitude','Has Online delivery','Price range'],inplace=True)

In [34]:
df.columns

Index(['City', 'Cuisines', 'Average Cost for two', 'Has Table booking',
       'Switch to order menu', 'Aggregate rating', 'Votes'],
      dtype='object')

In [35]:
df.corr()

,Average Cost for two,Has Table booking,Aggregate rating,Votes
Average Cost for two,1.000000,0.643845,0.329785,0.297741
Has Table booking,0.643845,1.000000,0.251972,0.224377
Aggregate rating,0.329785,0.251972,1.000000,0.291500
Votes,0.297741,0.224377,0.291500,1.000000

In [36]:
df['Switch to order menu'].nunique()

1

In [37]:
df['Switch to order menu'].value_counts()

No    7671
Name: Switch to order menu, dtype: int64

In [38]:
df.drop(columns=['Switch to order menu'],inplace=True)

In [39]:
df.shape

(7671, 6)

In [40]:
df.sample(5)

,City,Cuisines,Average Cost for two,Has Table booking,Aggregate rating,Votes
8005,New Delhi,"North Indian, Mughlai",450,0,3.2,30
2080,Gurgaon,Biryani,500,0,3.6,35
4812,New Delhi,"Cafe, French",1500,1,0.0,1
2139,Gurgaon,"Fast Food, North Indian",250,0,0.0,3
1298,Gurgaon,"Beverages, Juices",150,0,3.1,9

In [41]:
cuisine=df.groupby('Cuisines')['Average Cost for two'].mean().reset_index()

In [42]:
new_data=df.merge(cuisine,on='Cuisines')

In [43]:
new_data.rename(columns={'Average Cost for two_x':'cost','Average Cost for two_y':'Cuisine'},inplace=True)

In [44]:
new_data.drop(columns=['Cuisines'],inplace=True)

In [45]:
new_data=new_data[['City','Has Table booking','Aggregate rating','Votes','Cuisine','cost']]

In [46]:
new_data

           City  Has Table booking  Aggregate rating  Votes      Cuisine  cost
0       Gurgaon                  0               3.4     16   416.666667   350
1     New Delhi                  0               0.0      0   416.666667   200
2     New Delhi                  0               4.1     92   416.666667   700
3       Gurgaon                  1               2.7     80   755.511551   800
4       Gurgaon                  1               4.3   1887   755.511551  2000
...         ...                ...               ...    ...          ...   ...
7666      Noida                  1               2.2    116  2500.000000  2500
7667      Noida                  0               3.0     10   200.000000   200
7668      Noida                  0               3.5    105   450.000000   450
7669      Noida                  1               0.0      0  1000.000000  1000
7670      Noida                  0               2.0    161   450.000000   450

[7671 rows x 6 columns]

In [47]:
#new_data.drop(columns=['Votes','Aggregate rating'],inplace=True)

In [48]:
new_data

           City  Has Table booking  Aggregate rating  Votes      Cuisine  cost
0       Gurgaon                  0               3.4     16   416.666667   350
1     New Delhi                  0               0.0      0   416.666667   200
2     New Delhi                  0               4.1     92   416.666667   700
3       Gurgaon                  1               2.7     80   755.511551   800
4       Gurgaon                  1               4.3   1887   755.511551  2000
...         ...                ...               ...    ...          ...   ...
7666      Noida                  1               2.2    116  2500.000000  2500
7667      Noida                  0               3.0     10   200.000000   200
7668      Noida                  0               3.5    105   450.000000   450
7669      Noida                  1               0.0      0  1000.000000  1000
7670      Noida                  0               2.0    161   450.000000   450

[7671 rows x 6 columns]

In [49]:
X= new_data.iloc[:,:-1].values

In [50]:
Y= new_data.iloc[:,-1].values

In [51]:
X

array([['Gurgaon', 0, 3.4, 16, 416.6666666666667],
       ['New Delhi', 0, 0.0, 0, 416.6666666666667],
       ['New Delhi', 0, 4.1, 92, 416.6666666666667],
       ...,
       ['Noida', 0, 3.5, 105, 450.0],
       ['Noida', 1, 0.0, 0, 1000.0],
       ['Noida', 0, 2.0, 161, 450.0]], dtype=object)

In [52]:
Y

array([ 350,  200,  700, ...,  450, 1000,  450])

In [53]:
from sklearn.preprocessing import LabelEncoder
encoder= LabelEncoder()

In [54]:
X[:, 0]=encoder.fit_transform(X[:, 0])

In [55]:
X

array([[0, 0, 3.4, 16, 416.6666666666667],
       [1, 0, 0.0, 0, 416.6666666666667],
       [1, 0, 4.1, 92, 416.6666666666667],
       ...,
       [2, 0, 3.5, 105, 450.0],
       [2, 1, 0.0, 0, 1000.0],
       [2, 0, 2.0, 161, 450.0]], dtype=object)

In [56]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer
columnTransformer = ColumnTransformer([('encoder', OneHotEncoder(), [0])],     remainder='passthrough')
X=np.array(columnTransformer.fit_transform(X),dtype=np.str)

<ipython-input-56-8a00e980ec51>:4: DeprecationWarning: `np.str` is a deprecated alias for the builtin `str`. To silence this warning, use `str` by itself. Doing this will not modify any behavior and is safe. If you specifically wanted the numpy scalar type, use `np.str_` here.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  X=np.array(columnTransformer.fit_transform(X),dtype=np.str)

In [57]:
X.shape

(7671, 7)

In [58]:
from sklearn.model_selection import train_test_split

In [59]:
X_train, X_test, Y_train, Y_test = train_test_split(X, Y, test_size =
 0.20, random_state = 9)

In [60]:

X_train.shape

(6136, 7)

In [61]:
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()

In [62]:
regressor.fit(X_train,Y_train)

/home/nagark312/.local/lib/python3.8/site-packages/sklearn/utils/validation.py:63: FutureWarning: Arrays of bytes/strings is being converted to decimal numbers if dtype='numeric'. This behavior is deprecated in 0.24 and will be removed in 1.1 (renaming of 0.26). Please convert your data to numeric values explicitly instead.
  return f(*args, **kwargs)

LinearRegression()

In [63]:
Y_pread=regressor.predict(X_test)

/home/nagark312/.local/lib/python3.8/site-packages/sklearn/utils/validation.py:63: FutureWarning: Arrays of bytes/strings is being converted to decimal numbers if dtype='numeric'. This behavior is deprecated in 0.24 and will be removed in 1.1 (renaming of 0.26). Please convert your data to numeric values explicitly instead.
  return f(*args, **kwargs)

In [64]:
from sklearn.metrics import r2_score

In [65]:
r2_score(Y_test,Y_pread)

0.7189272138600029